{
  "recetas": [
    {
      "ingredientes": [
        {
          "producto": "Cebolla",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Pimiento morrón",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Diente de ajo",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Pechuga de pollo",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Tomate",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Arroz",
          "cantidad": 250,
          "unidad": "mg"
        },
        {
          "producto": "Caldo de ave o verduras",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Aceto balsámico (o vino blanco)",
          "cantidad": 50,
          "unidad": "ml"
        },
        {
          "producto": "Condimento para arroz",
          "cantidad": 50,
          "unidad": "mg"
        },
        {
          "producto": "Ciboulette picado (para decorar)",
          "cantidad": 100,
          "unidad": "mg"
        }
      ],
      "preparacion": [
        {
          "paso": "Trocear el pollo en pedazos pequeños y saltearlo en la sartén caliente (con un chorrito de aceite) hasta que esté dorado de ambas partes. Retirar y reservar."
        },
        {
          "paso": "Saltear en el fondo de cocción del pollo la cebolla, el morrón y el ajo, todo picado pequeño."
        },
        {
          "paso": "Cuando la cebolla esté transparente, incorporar el tomate, también picado. Sofreír hasta que tome un color amarronado."
        },
        {
          "paso": "Incorporar los trozos de pollo que habíamos reservado. Agregar el arroz y remover, salteando a fuego medio, hasta que los granos de arroz se vean transparentes."
        },
        {
          "paso": "Agregar el doble de agua (2 tazas), salpimentar y condimentar. Agregar también el chorro de aceto o vino. Revolver una sola vez y dejar que hierva. Cuando hirvió, bajar el fuego a medio y cocinar destapado, hasta que el arroz haya consumido toda el agua. No revolver durante la cocción."
        },
        {
          "paso": "Servir y llover con ciboulette picado. Se puede comer con limón."
        }
      ],
      "nombreReceta": "Arroz con Pollo Clásico",
      "imagen": "https://www.paulinacocina.net/wp-content/uploads/2015/02/arroz-pollo.jpg",
      "categoria": "Plato Principal",
      "descripcionBreve": "El arroz con pollo es una receta originaria de España. Es un plato a base de pollo y arroz, condimentado con ajo, cebolla y azafrán.",
      "descripcionAmplia": "El arroz con pollo es un plato delicioso y fácil de hacer, perfecto para cualquier ocasión. Tanto si buscas una comida sencilla para la semana como si quieres impresionar a tus invitados, este plato te va a decepcionar . Así que te pregunto: ¿Por qué no intentarlo? Y una advertencia: puede que ésta se convierta en una de sus nuevas recetas favoritas.",
      "id": "d50c"
    },
    {
      "ingredientes": [
        {
          "producto": "Milanesas",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Queso mozzarella",
          "cantidad": 150,
          "unidad": "g"
        },
        {
          "producto": "Jamón cocido",
          "cantidad": 150,
          "unidad": "g"
        },
        {
          "producto": "Lata de puré de tomate",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Cebolla",
          "cantidad": 1,
          "unidad": "unidad/es"
        },
        {
          "producto": "Dientes de Ajo",
          "cantidad": 2,
          "unidad": "unidad/es"
        },
        {
          "producto": "Hojas de Laurel",
          "cantidad": 2,
          "unidad": "unidad/es"
        }
      ],
      "preparacion": [
        {
          "paso": "Para la salsa de tomate: Picamos el ajo y la cebolla."
        },
        {
          "paso": "Para la salsa de tomate: Calentamos una olla con aceite, ponemos el ajo y la cebolla dentro y esperamos que la cebolla se transparente."
        },
        {
          "paso": "Para la salsa de tomate: Después, agregamos el puré de tomate y las dos hojas de laurel, deje cocinar por alrededor de 20 minutos."
        },
        {
          "paso": "Para la salsa de tomate: Agregamos sal y pimienta a gusto."
        },
        {
          "paso": "Milanesa: Vamos a colocar primero, por encima de nuestra milanesa, la salsa que acabamos de hacer. "
        },
        {
          "paso": "Milanesa: Luego, colocamos unas fetas de jamón cocido"
        },
        {
          "paso": "Milanesa: Finalmente, por encima, ponemos nuestro queso."
        },
        {
          "paso": "Milanesa: Así, las vamos a llevar al horno 180º hasta que se derrita el queso y chorree por los costados generando el efecto más hermoso y tentador del universo.Así, las vamos a llevar al horno 180º hasta que se derrita el queso y chorree por los costados generando el efecto más hermoso y tentador del universo."
        },
        {
          "paso": "Milanesa: Al sacarlas podemos tirar por encima unas pizcas de orégano y ¡listo!"
        }
      ],
      "nombreReceta": "Milanesa Napolitana",
      "imagen": "https://www.paulinacocina.net/wp-content/uploads/2015/03/P1150541-e1439164269502.jpg",
      "categoria": "Plato Principal",
      "descripcionBreve": "La milanesa a la napolitana es un plato de origen argentino típico de la gastronomía de países rioplatenses que tiene su origen en la influencia de la Inmigración italiana.",
      "descripcionAmplia": "Consiste en una milanesa, habitualmente de carne, llevada al horno para ser recubierta como una pizza, con rodajas de tomate y queso mozzarella, añadiendo diversos ingredientes (como jamón o cebolla).​ Habitualmente se sirve con una guarnición de papas fritas.",
      "id": "be33"
    }
  ],
  "usuarios": [
    {
      "email": "prueba@mail.com",
      "password": "123"
    }
  ]
}